{
    "subclass": "PortfolioOptimization",
    "reference": "Markowitz, H. Portfolio Selection: Efficient Diversification of Investments. Journal of Finance, 7(1), 77-91, 1952.",
    "reference_url": "https://www.jstor.org/stable/2975974",
    "math_formula": "### Mathematical Model\nFor n assets, each asset i has the following parameters:\n- **Return** r_i: Expected return of asset i\n- **Weight** w_i: Portfolio weight allocated to asset i\n- **Covariance** σ_{ij}: Covariance between assets i and j\n\nAdditionally:\n- **Target Return** R: Minimum required portfolio return\n- **Budget Constraint**: Sum of weights equals 1\n- **Weight Bounds**: l_i ≤ w_i ≤ u_i for each asset i\n\n$$\n\\begin{aligned}\n&\\text{Minimize} && \\sum_{i=1}^n \\sum_{j=1}^n w_i w_j \\sigma_{ij} \\\\\n&\\text{Subject to} && \\sum_{i=1}^n w_i r_i \\geq R \\\\\n& && \\sum_{i=1}^n w_i = 1 \\\\\n& && l_i \\leq w_i \\leq u_i \\quad \\forall i = 1,\\ldots,n\n\\end{aligned}\n$$",
    "natural_language_example": "An investment manager needs to construct an optimal portfolio from 5 different stocks:\n* Tech Stock A: Expected return 12%, risk 20%, max allocation 30%\n* Bank Stock B: Expected return 8%, risk 15%, max allocation 30%\n* Energy Stock C: Expected return 10%, risk 18%, max allocation 30%\n* Retail Stock D: Expected return 9%, risk 16%, max allocation 30%\n* Healthcare Stock E: Expected return 11%, risk 17%, max allocation 30%\n\nThe correlations between stocks range from -0.2 to 0.8. The manager wants to:\n* Achieve a minimum portfolio return of 10%\n* Minimize overall portfolio risk\n* Maintain full investment (weights sum to 100%)\n* Avoid excessive concentration in any single stock\n\nThe optimization problem involves finding the optimal weight allocation for each stock that minimizes portfolio risk while meeting the return target and diversification constraints. For example:\n* Stock A: 25%\n* Stock B: 15%\n* Stock C: 20%\n* Stock D: 20%\n* Stock E: 20%\n\nThis allocation would need to be validated against the optimization criteria to ensure it provides the best risk-adjusted return while satisfying all constraints."
}