{
    "subclass": "Set Cover",
    "reference":"Caprara, A., Toth, P., & Fischetti, M. (2000). Algorithms for the set covering problem. Annals of Operations Research, 98(1), 353-371.",
    "reference_url": "https://www.dei.unipd.it/~fisch/papers/survey_set_covering_problem.pdf",
    "math_formula": "\\begin{align*}\n\\min & \\sum_{i=1}^{n} x_i \\\\\n\\text{s.t.} & \\sum_{i : e_j \\in S_i} x_i \\geq 1 \\quad \\forall e_j \\in U \\\\\n& x_i \\in \\{0, 1\\} \\quad \\forall i \\in \\text{Sets}\n\\end{align*}",
    "natural_language_example": "Imagine you are managing a transportation network where you need to select specific routes to ensure that all required destinations are covered efficiently. There are ten potential routes available, each with a different cost associated with its selection. The goal is to minimize the total cost of selecting these routes while ensuring that every destination is covered by at least one selected route.\n\nHere are the details of each route and the costs associated with selecting them:\n- Route 1: Cost of selection is $10\n- Route 2: Cost of selection is $10\n- Route 3: Cost of selection is $2\n- Route 4: Cost of selection is $10\n- Route 5: Cost of selection is $10\n- Route 6: Cost of selection is $4\n- Route 7: Cost of selection is $1\n- Route 8: Cost of selection is $9\n- Route 9: Cost of selection is $7\n- Route 10: Cost of selection is $9\n\nEach destination must be covered by at least one of the selected routes. The coverage requirements are as follows:\n- Destination e1 must be covered by either Route 1, Route 4, or Route 8.\n- Destination e2 must be covered by either Route 4 or Route 8.\n- Destination e3 must be covered by either Route 5, Route 8, or Route 9.\n- Destination e4 must be covered by either Route 1, Route 3, Route 5, Route 6, or Route 7.\n- Destination e5 must be covered by either Route 1, Route 5, Route 6, Route 8, Route 9, or Route 10.\n- Destination e6 must be covered by either Route 1, Route 5, Route 6, Route 8, Route 9, or Route 10.\n- Destination e7 must be covered by Route 5.\n- Destination e8 must be covered by Route 2.\n- Destination e9 must be covered by either Route 9 or Route 10.\n- Destination e10 must be covered by either Route 6, Route 8, or Route 9.\n- Destination e11 must be covered by either Route 2, Route 3, or Route 6.\n- Destination e12 must be covered by either Route 4 or Route 6.\n- Destination e13 must be covered by Route 1.\n- Destination e14 must be covered by either Route 1, Route 8, Route 9, or Route 10.\n- Destination e15 must be covered by either Route 3, Route 4, Route 5, or Route 6.\n- Destination e16 must be covered by either Route 8 or Route 9.\n- Destination e17 must be covered by Route 1.\n- Destination e18 must be covered by either Route 1, Route 5, Route 6, Route 7, Route 9, or Route 10.\n- Destination e19 must be covered by either Route 5 or Route 10.\n- Destination e20 must be covered by either Route 4, Route 5, or Route 9.\n\nYour task is to decide which routes to select to cover all destinations while minimizing the total cost of selection. Each route can either be selected (with a cost) or not selected (with no cost), and at least one route must cover each destination. The objective is to find the combination of routes that meets all coverage requirements at the lowest possible cost."
}